package olya;
/*
Создать класс Модель. У модели следующие атрибуты: имя, вес, возраст, цвет глаз, зарплата. Создать конструктор с параметром
имя и дефолтный конструктор. Создать метод poxudenie ничего не возвращающий, принимающий число. Метод выводит имя модели и вес, на который она похудела.
Пример вывода "Ура Оля похудела на 5 кг :)". Второй метод potolstela - по аналогии выводит "Ужас! Хаяля потолстела на 20 кг:((".
Создать 2 объекта (один с помощью дефолтного конструктора, второй с помощью конструктора с параметром) и вызвать у них них по 1 из методов.
САМИМ ПРИДУМАТЬ ЕЩЁ 1 МЕТОД (например,  с зар платой или с возрастом) и так же вызвать его у объектов.
 */
public class Model {

}
