package olya;

import java.util.Scanner;

public class Model {
    public static void main(String[] args) {
        /*
        Объявите переменные и сразу присвойте им значение:
        - rateUSD (курс доллара)
        - rateEUR (курс евро)
        - rateCNY (курс юаня)
         */
     

            /* Если введена команда для перевода в доллары
               Выполните конвертацию рублей в доллары с использованием курса "rateUSD"
               Сохраните результат в переменную
               Проверьте, что результат не меньше нуля и выведите сообщение об ошибке, если меньше
               Выведите результат конвертации в виде сообщения */

            /* Если введена команда для перевода в евро
               Выполните конвертацию рублей в евро с использованием курса "rateEUR"
               Сохраните результат в переменную
               Проверьте, что результат не меньше нуля и выведите сообщение об ошибке, если меньше
               Выведите результат конвертации в виде сообщения */

            /* Если введена команда для перевода в юани
               Выполните конвертацию рублей в юани с использованием курса "rateCNY"
               Сохраните результат в переменную
               Проверьте, что результат не меньше нуля и выведите сообщение об ошибке, если меньше
               Выведите результат конвертации в виде сообщения */

            /* Неизвестная команда
               Выведите сообщение "Такой команды нет." */
    }
    // Вывод сообщения о завершении работы программы
}